package go.deyu.stupidgame2.data.model

@kotlinx.serialization.Serializable
data class Message(
    val content: String,
    val role: String
)

object MessageBook {
    fun getNewGameMessage() = Message(
        content = "## 開局\n" +
                "\n" +
                "我們來玩一個遊戲，請您像個編劇創造一個殺人案件的故事，讓我來猜猜看兇手是誰，嫌疑犯至少要大於三個\n" +
                "遊戲資料請幫我用 Json 的方式呈現，資料結構請使用我提供的格式，回覆只能有json文字資料，感謝！(回覆不要``` json ```)\n" +
                "\n" +
                "{\n" +
                "  \"story\": \"一位名叫王柏翔的年輕企業家，在成功地完成了一筆重要的商業交易後，卻在公司辦公室中被人發現倒在地上，頸部被利器切斷，而現場留下了一把帶有指紋的刀和一張白色信封。\",\n" +
                "  \"suspects\": [\n" +
                "    {\n" +
                "      \"name\": \"女友\",\n" +
                "      \"clothing\": \"深藍色毛衣\",\n" +
                "      \"accessories\": \"項鍊\",\n" +
                "      \"alibi\": \"她當晚在家中，和受害人約定當晚一起吃晚餐\",\n" +
                "      \"motive\": \"受害人的不忠行為\",\n" +
                "      \"questions\": [\n" +
                "        {\n" +
                "          \"question\": \"你和王柏翔的感情是否穩定？\",\n" +
                "          \"answer\": \"我們感情很好，我從沒有懷疑過他。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你對他的商業交易有所了解嗎？\",\n" +
                "          \"answer\": \"他只和我提過一些簡單的內容，我沒有太多的了解。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你知道那把血跡斑斑的刀是誰的嗎？\",\n" +
                "          \"answer\": \"我從未見過那把刀，也不知道是誰的。\"\n" +
                "        }\n" +
                "      ]\n" +
                "    },\n" +
                "    {\n" +
                "      \"name\": \"商業競爭對手\",\n" +
                "      \"clothing\": \"黑色西裝\",\n" +
                "      \"accessories\": \"手錶\",\n" +
                "      \"alibi\": \"他當晚在家中，和家人一起度過\",\n" +
                "      \"motive\": \"商業競爭\",\n" +
                "      \"questions\": [\n" +
                "        {\n" +
                "          \"question\": \"你和王柏翔的關係如何？\",\n" +
                "          \"answer\": \"我們是商業競爭對手，關係不錯，但也不算特別好。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你對他的商業交易有所了解嗎？\",\n" +
                "          \"answer\": \"我有所耳聞，但不知道具體的內容。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你知道那張白色信封的內容嗎？\",\n" +
                "          \"answer\": \"不知道，我沒有見過那封信。\"\n" +
                "        }\n" +
                "      ]\n" +
                "    },\n" +
                "    {\n" +
                "      \"name\": \"王柏翔的助手\",\n" +
                "      \"clothing\": \"藍色襯衫\",\n" +
                "      \"accessories\": \"眼鏡\",\n" +
                "      \"alibi\": \"他當晚在公司加班\",\n" +
                "      \"motive\": \"自己的事業\",\n" +
                "      \"questions\": [\n" +
                "        {\n" +
                "          \"question\": \"你和王柏翔的關係如何？\",\n" +
                "          \"answer\": \"我是他的助手，關係很好，也很尊重他。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你知道他的商業交易的內容嗎？\",\n" +
                "          \"answer\": \"我對他的商業交易有較為詳細的了解。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你知道那把刀是誰的嗎？\",\n" +
                "          \"answer\": \"我不知道，也不曾見過那把刀。\"\n" +
                "        }\n" +
                "      ]\n" +
                "    }\n" +
                "  ],\n" +
                "  \"cubes\": [\n" +
                "    \"在案發現場發現了一張白色信封，但是信封裡面的內容卻被人徹底地清空了。\",\n" +
                "    \"在警方對王柏翔的辦公室進行搜查時，發現了一份極為重要的文件，但是該文件的原本卻不見了。\",\n" +
                "    \"王柏翔最近的幾次行蹤顯示，他一直在試圖尋找一份特定的文件，並且在事發前一晚，他曾經打電話給一位重要的商業合作夥伴，希望能夠取得這份文件。\"\n" +
                "  ],\n" +
                "  \"tell_user\": \"現在你可以開始詢問我有關這三位嫌疑犯的問題，來看看你能否找出兇手。\",\n" +
                "  \"answer\": {\n" +
                "    \"suspect\":   {\n" +
                "      \"name\": \"商業競爭對手\",\n" +
                "      \"clothing\": \"黑色西裝\",\n" +
                "      \"accessories\": \"手錶\",\n" +
                "      \"alibi\": \"他當晚在家中，和家人一起度過\",\n" +
                "      \"motive\": \"商業競爭\",\n" +
                "      \"questions\": [\n" +
                "        {\n" +
                "          \"question\": \"你和王柏翔的關係如何？\",\n" +
                "          \"answer\": \"我們是商業競爭對手，關係不錯，但也不算特別好。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你對他的商業交易有所了解嗎？\",\n" +
                "          \"answer\": \"我有所耳聞，但不知道具體的內容。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"question\": \"你知道那張白色信封的內容嗎？\",\n" +
                "          \"answer\": \"不知道，我沒有見過那封信。\"\n" +
                "        }\n" +
                "      ]\n" +
                "    },\n" +
                "    \"guess_fail\": \"很抱歉！這次猜錯了。\",\n" +
                "    \"guess_success\": \"恭喜你猜對了！\",\n" +
                "    \"full_story\": \"案件經過是這樣的：王柏翔在完成一筆重要的商業交易後，遭到了商業競爭對手的殺害。警方發現，兇手是在事發前一晚，打電話給王柏翔，詢問特定文件的下落，並趁此機會殺害了他。警方在王柏翔的辦公室中找到了一份極為重要的文件的複印件，原件則被兇手帶走了。在調查中，警方發現，兇手是通過打電話的方式，偽裝成商業合作夥伴，詢問特定文件的下落，並趁機殺害了王柏翔。\"\n" +
                "  }\n" +
                "}\n" +
                "\n" +
                "給我全新的故事吧！然後嫌疑犯的資料給我完整一點，並且故事劇情希望能豐富一些，有邏輯可循一些！\n",
        role = "user"
    )


    fun getTestMessage() = Message(
        content = "## 文字冒險RPG遊戲生成\n" +
                "## 目前進度如下 請按照我的選擇給我下一階段劇情\n" +
                "```\n" +
                "{\n" +
                "    \"player\": {\n" +
                "      \"name\": \"黃得瑜\",\n" +
                "      \"profession\": \"劍士\",\n" +
                "      \"health\": {\n" +
                "        \"current\": 5,\n" +
                "        \"max\": 100\n" +
                "      },\n" +
                "      \"experience\": {\n" +
                "        \"current\": 300,\n" +
                "        \"requiredToLevelUp\": 400\n" +
                "      },\n" +
                "      \"level\": 4,\n" +
                "      \"equipment\": {\n" +
                "        \"armor\": {\n" +
                "          \"name\": \"堅固的鎧甲\",\n" +
                "          \"defense\": 5\n" +
                "        },\n" +
                "        \"weapon\": {\n" +
                "          \"name\": \"龍骨大劍\",\n" +
                "          \"attack\": 30\n" +
                "        }\n" +
                "      },\n" +
                "      \"items\": [\n" +
                "        \"寶藏鑰匙\",\n" +
                "        \"恢復藥水\"\n" +
                "      ],\n" +
                "      \"skills\": [\n" +
                "        \"初階劍術\",\n" +
                "        \"烈焰爆裂\",\n" +
                "        \"強力斬擊\",\n" +
                "        \"狂風連斬\"\n" +
                "      ]\n" +
                "    },\n" +
                "    \"currentProgress\": {\n" +
                "      \"story\": \"你打開了鐵門，眼前豁然開朗。進入門後，你發現自己置身於一個巨大的廣場，廣場上屹立著一個強大的巨龍。這是一個高難度的Boss戰！你必須全力以赴才有機會擊敗它。\",\n" +
                "      \"location\": \"洞穴深處-廣場\",\n" +
                "      \"nextStep\": [\n" +
                "        {\n" +
                "          \"name\": \"挑戰巨龍\",\n" +
                "          \"description\": \"你決定挑戰這隻強大的巨龍，期望從它身上獲得豐富的戰利品和經驗。\"\n" +
                "        },\n" +
                "        {\n" +
                "          \"name\": \"回村\",\n" +
                "          \"description\": \"你決定暫時撤退，返回村莊恢復體力，重新計劃對抗巨龍的策略。\"\n" +
                "        }\n" +
                "      ]\n" +
                "    },\n" +
                "    \"map\": {\n" +
                "      \"name\": \"洞穴\"\n" +
                "    }\n" +
                "  }\n" +
                "```\n" +
                "我選擇 \"挑戰巨龍\" , 回覆請遵循上列格式json填入新劇情資料 , 戰鬥後請把戰利品以及經驗值等等直接更新player status\n" +
                "希望遵循下列條件進行之後劇情\n" +
                "1. 這個遊戲是中等難度 , 不謹慎選擇請盡量懲罰玩家(例如:戰鬥失敗直接歸0)\n" +
                "2. 遇到戰鬥請一次完成 , 戰鬥失敗請不要提示我直接把生命值歸0結束遊戲 , 戰鬥勝利則記得更新人物狀態(經驗 血量 裝備 技能等等)\n" +
                "3. 每次冒險可隨機遇到Boss(高難 但有大量戰利品以及經驗) 給玩家挑戰! .\n" +
                "4. 每次冒險結束後回村.\n" +
                "5. 每次冒險結束後回村,可選擇是否繼續冒險.\n" +
                "6. 每次劇情都要有新進度\n",
        role = "user"
    )

}